{
    "Applev scab": [
        "Use chemicals like Captan, Chlorothalonil, Mancozeb, Myclobutanil, Propiconazole, or Thiophanate Methyl. Follow the recommended spray schedule and timing for best results.",
        "Cut off and remove infected branches, leaves, and fruit. This practice helps reduce the spread of the fungus.",
        "Ensure proper spacing between trees for good airflow. Better airflow helps reduce humidity and fungal growth.",
        "Collect and destroy fallen leaves in the fall or early spring. This reduces the primary source of the fungus.",
        "Mix 5% urea with water and spray it on trees after harvest or on fallen leaves in the fall or spring. This helps leaves decay faster and reduces fungus.",
        "Consider planting apple varieties that are resistant to apple scab. This proactive approach can prevent future issues.",
        "Pay attention to the weather, especially during cool, wet springs. Taking preventive measures during these times can help.",
        "Use organic methods like neem oil or sulfur-based sprays for a more natural approach to managing apple scab."
    ],
    "Apple Black Rot": [
        "Spray chemicals like Captan or Mancozeb on your apple trees. Do this early in the growing season and follow the instructions on the label.",
        "Cut off and remove infected branches, leaves, and fruit. Always clean your pruning tools to prevent spreading the disease.",
        "Keep your trees well-watered and fertilized to improve their overall health and resistance to diseases.",
        "Ensure enough space between trees for good airflow. This helps to keep the leaves dry and reduces fungal growth.",
        "Regularly pick up and dispose of fallen leaves and fruit. This helps to remove the disease source.",
        "Keep an eye on weather conditions, especially during warm, wet periods. Take preventive measures when conditions favor the disease.",
        "Use organic treatments like neem oil to manage the disease naturally."
    ],
    "Apple Cedar Apple Rust": [
        "Remove nearby juniper trees to reduce the risk.",
        "Apply fungicides like Myclobutanil or Propiconazole at the start of the growing season.",
        "Cut off and remove any leaves, fruit, or branches showing signs of rust.",
        "Pay attention to the weather, especially warm, wet conditions.",
        "Choose apple varieties that are resistant to cedar apple rust.",
        "Ensure good spacing between trees to allow air to move freely.",
        "Use organic treatments like sulfur sprays or neem oil."
    ],
    "Healthy Apple": [
        "Continue regular monitoring and proper care.",
        "Ensure proper spacing and pruning for good air circulation.",
        "Use balanced fertilizers to maintain tree health.",
        "Apply mulch around the base of the trees to retain moisture.",
        "Monitor for any signs of disease or pests and take prompt action."
    ],
    "Bean Angular Leaf Spot": [
        "Apply fungicides like copper-based sprays according to the label instructions.",
        "Rotate crops to avoid planting beans in the same location year after year.",
        "Remove and destroy infected plant debris to reduce the source of the fungus.",
        "Ensure proper spacing and air circulation to reduce humidity around the plants.",
        "Water plants at the base to avoid wetting the foliage, which can encourage fungal growth."
    ],
    "Healthy Bean": [
        "Maintain good soil health with regular fertilization and organic matter.",
        "Ensure proper spacing and air circulation around the plants.",
        "Monitor regularly for signs of disease or pests and take prompt action.",
        "Use drip irrigation to keep foliage dry and reduce the risk of fungal diseases.",
        "Rotate crops to prevent the buildup of soil-borne diseases."
    ],
    "Bean Rust": [
        "Apply fungicides like chlorothalonil or mancozeb as recommended on the label.",
        "Remove and destroy infected plant debris to prevent the spread of the fungus.",
        "Ensure proper spacing and air circulation to reduce humidity around the plants.",
        "Avoid overhead watering to keep foliage dry and reduce fungal growth.",
        "Rotate crops to prevent the buildup of rust spores in the soil."
    ],
    "Cherry(including sour) Powdery Mildew": [
        "Apply fungicides like sulfur, neem oil, or potassium bicarbonate as directed on the label.",
        "Prune and remove infected branches to improve air circulation and reduce disease spread.",
        "Ensure proper spacing and pruning for good air circulation.",
        "Avoid overhead watering to keep foliage dry and reduce fungal growth.",
        "Clean up and dispose of fallen leaves and debris to reduce the source of the fungus."
    ],
    "Healthy Cherry(including sour)": [
        "Continue regular monitoring and proper care.",
        "Ensure proper spacing and pruning for good air circulation.",
        "Use balanced fertilizers to maintain tree health.",
        "Apply mulch around the base of the trees to retain moisture.",
        "Monitor for any signs of disease or pests and take prompt action."
    ],
    "Corn(maize) Cercospora Leaf Spot Gray Leaf Spot": [
        "Apply fungicides like strobilurins or triazoles as recommended on the label.",
        "Rotate crops to prevent the buildup of fungal spores in the soil.",
        "Remove and destroy infected plant debris to reduce the source of the fungus.",
        "Ensure proper spacing and air circulation to reduce humidity around the plants.",
        "Plant resistant corn varieties to reduce the risk of infection."
    ],
    "Corn(maize) Common Rust": [
        "Apply fungicides like mancozeb or chlorothalonil as recommended on the label.",
        "Rotate crops to prevent the buildup of rust spores in the soil.",
        "Remove and destroy infected plant debris to reduce the source of the fungus.",
        "Ensure proper spacing and air circulation to reduce humidity around the plants.",
        "Plant resistant corn varieties to reduce the risk of infection."
    ],
    "Corn(maize) Northern Leaf Blight": [
        "Apply fungicides such as azoxystrobin, pyraclostrobin, or prothioconazole at the first sign of disease. Follow label directions for application.",
        "Rotate crops with non-host crops such as soybeans or small grains to reduce disease pressure.",
        "Select hybrid varieties that have resistance or tolerance to Northern Leaf Blight.",
        "Plow under crop debris after harvest to reduce the amount of inoculum present in the field.",
        "Planting dates can be adjusted to avoid periods of high disease pressure."
    ],
    "Healthy Corn(maize)": [
        "Maintain regular monitoring to ensure no disease develops.",
        "Continue with balanced fertilization and adequate irrigation practices.",
        "Keep an eye on environmental conditions that may favor disease outbreaks.",
        "Ensure good field sanitation and rotate crops to prevent disease buildup.",
        "Use hybrid varieties known for their disease resistance."
    ],
    "Grape Black Rot": [
        "Apply fungicides like Myclobutanil, Mancozeb, or Captan starting at the pre-bloom stage. Follow a regular spray schedule as recommended.",
        "Prune and remove diseased canes and fruit mummies during the dormant season to reduce inoculum.",
        "Ensure good air circulation within the vineyard by proper pruning and spacing of vines.",
        "Remove and destroy fallen leaves and fruit to eliminate sources of infection.",
        "Use resistant grape varieties if available."
    ],
    "Grape Esca (Black Measles)": [
        "Remove and burn infected wood to prevent spread.",
        "Apply fungicides as a preventative measure, especially after heavy rains.",
        "Improve soil drainage to reduce waterlogging, which can exacerbate the disease.",
        "Practice good vineyard sanitation by removing and destroying prunings.",
        "Avoid wounding the vines during cultural operations to reduce infection sites."
    ],
    "Grape Leaf Blight (Isariopsis Leaf Spot)": [
        "Apply protective fungicides such as Mancozeb or Copper-based products at the first sign of disease.",
        "Prune affected leaves and canes to reduce disease inoculum.",
        "Ensure proper vineyard management practices to reduce humidity and promote air circulation.",
        "Remove and destroy fallen leaves and debris from the vineyard floor.",
        "Consider using resistant varieties or rootstocks if available."
    ],
    "Healthy Grape": [
        "Regularly monitor the vineyard for signs of disease.",
        "Maintain a balanced fertilization program to keep vines healthy.",
        "Ensure proper irrigation practices to avoid water stress.",
        "Practice good canopy management to improve air circulation.",
        "Keep the vineyard floor clean by removing weeds and debris."
    ],
    "Pepper Bell Bacterial Spot": [
        "Apply copper-based bactericides at the first sign of disease. Follow label recommendations for application frequency.",
        "Remove and destroy infected plant material to reduce disease spread.",
        "Use drip irrigation instead of overhead watering to keep foliage dry.",
        "Practice crop rotation with non-host crops to minimize disease buildup in the soil.",
        "Use resistant pepper varieties if available."
    ],
    "Healthy Pepper Bell": [
        "Regularly monitor your peppers for any signs of disease.",
        "Maintain a balanced fertilization schedule to ensure plant health.",
        "Use drip irrigation to keep foliage dry and reduce disease risk.",
        "Keep the growing area free of weeds and debris to improve air circulation.",
        "Rotate crops to prevent soil-borne diseases from building up."
    ],
    "Potato Early Blight": [
        "Apply fungicides such as Chlorothalonil or Mancozeb at the first sign of disease. Follow label instructions for application.",
        "Remove and destroy infected plant debris to reduce sources of inoculum.",
        "Avoid overhead watering to keep foliage dry and reduce disease spread.",
        "Plant potatoes in well-drained soil and avoid excessive irrigation.",
        "Practice crop rotation with non-host crops to minimize disease buildup in the soil."
    ],
    "Potato Late Blight": [
        "Apply fungicides like Chlorothalonil, Mancozeb, or Copper-based products at the first sign of disease. Adhere to recommended spray intervals.",
        "Remove and destroy infected plant material to prevent further spread.",
        "Ensure good air circulation by spacing plants appropriately and pruning as needed.",
        "Avoid overhead irrigation and water plants at the base to reduce leaf wetness.",
        "Plant blight-resistant potato varieties if available."
    ],
    "Healthy Potato": [
        "Regularly inspect potato plants for any signs of disease or pest damage.",
        "Maintain a consistent watering schedule to avoid water stress.",
        "Fertilize with balanced nutrients to support healthy growth.",
        "Keep the garden free of weeds and debris to promote good air circulation.",
        "Rotate crops to maintain soil health and prevent disease buildup."
    ],
    "Strawberry Leaf Scorch": [
        "Apply fungicides such as Captan or Myclobutanil at the first sign of disease. Follow the label for application details.",
        "Remove and destroy infected leaves and debris to reduce disease spread.",
        "Ensure good air circulation by spacing plants adequately and pruning as necessary.",
        "Water plants at the base rather than overhead to keep foliage dry.",
        "Use resistant strawberry varieties if available."
    ],
    "Healthy Strawberry": [
        "Regularly monitor strawberry plants for signs of disease or pests.",
        "Maintain a balanced fertilization schedule to support healthy growth.",
        "Water plants at the base to avoid wetting the foliage and reduce disease risk.",
        "Keep the planting area free of weeds and debris to improve air circulation.",
        "Practice crop rotation to prevent soil-borne diseases."
    ],
    "Tomato Bacterial Spot": [
        "Apply copper-based bactericides at the first sign of disease. Follow label instructions for application.",
        "Remove and destroy infected plant material to reduce the spread of the disease.",
        "Use drip irrigation to avoid wetting the foliage and reduce infection risk.",
        "Practice crop rotation with non-host plants to minimize disease buildup in the soil.",
        "Use resistant tomato varieties if available."
    ],
    "Tomato Early Blight": [
        "Apply fungicides like Chlorothalonil or Mancozeb at the first sign of disease. Follow label recommendations for use.",
        "Remove and destroy affected leaves and plant debris to minimize sources of infection.",
        "Avoid overhead watering to keep leaves dry and reduce the spread of the disease.",
        "Space plants adequately to ensure good air circulation.",
        "Practice crop rotation and use disease-resistant tomato varieties."
    ],
    "Tomato Late Blight": [
        "Apply fungicides such as Chlorothalonil, Mancozeb, or Copper-based products at the first sign of disease. Follow label instructions for application.",
        "Remove and destroy infected plants to prevent further spread.",
        "Ensure good air circulation by spacing plants appropriately and pruning as needed.",
        "Avoid overhead watering and water plants at the base to reduce leaf wetness.",
        "Plant blight-resistant tomato varieties if available."
    ],
    "Tomato Leaf Mold": [
        "Apply fungicides such as Chlorothalonil or Copper-based products when symptoms first appear. Follow label directions for application.",
        "Prune affected leaves and ensure good air circulation around plants.",
        "Reduce humidity levels in the growing area to prevent the disease.",
        "Water plants at the base to keep foliage dry.",
        "Use disease-resistant varieties when possible."
    ],
    "Tomato Septoria Leaf Spot": [
        "Apply fungicides like Chlorothalonil or Copper-based products at the first sign of disease. Follow the label for application details.",
        "Remove and destroy infected leaves and debris to reduce sources of infection.",
        "Space plants to ensure good air circulation and reduce humidity.",
        "Avoid overhead watering and water plants at the base to keep foliage dry.",
        "Practice crop rotation and use resistant tomato varieties."
    ],
    "Tomato Spider Mites Two-Spotted Spider Mite": [
        "Apply miticides or insecticidal soap to control spider mites. Follow the label for application details.",
        "Keep plants well-watered to reduce stress and make them less susceptible to mite infestations.",
        "Remove and destroy heavily infested leaves to reduce mite populations.",
        "Encourage natural predators such as ladybugs and predatory mites.",
        "Regularly monitor plants for signs of spider mites and take action early."
    ],
    "Tomato Target Spot": [
        "Apply fungicides like Mancozeb or Copper-based products at the first sign of disease. Follow label recommendations for use.",
        "Remove and destroy affected leaves and plant debris to minimize sources of infection.",
        "Ensure good air circulation around plants by proper spacing and pruning.",
        "Water plants at the base to keep foliage dry and reduce disease spread.",
        "Use disease-resistant tomato varieties when available."
    ],
    "Tomato Yellow Leaf Curl Virus": [
        "Control whitefly populations with insecticides to reduce the spread of the virus. Follow label instructions for use.",
        "Remove and destroy infected plants to prevent further spread.",
        "Use virus-resistant tomato varieties if available.",
        "Implement proper sanitation practices by cleaning tools and equipment.",
        "Use reflective mulches to repel whiteflies and reduce virus incidence."
    ],
    "Tomato Mosaic Virus": [
        "Remove and destroy infected plants to prevent the spread of the virus.",
        "Practice good sanitation by cleaning hands, tools, and equipment after handling infected plants.",
        "Use virus-free seeds and transplants to reduce the risk of infection.",
        "Avoid smoking around tomato plants, as the virus can be spread through tobacco products.",
        "Use resistant tomato varieties if available."
    ],
    "Healthy Tomato": [
        "Regularly monitor tomato plants for any signs of disease or pest issues.",
        "Maintain a balanced fertilization schedule to support healthy growth.",
        "Water plants at the base to avoid wetting the foliage and reduce disease risk.",
        "Ensure good air circulation by spacing plants appropriately."
    ]
}