{
    "Tavelure du Pommier": [
        "Utilisez des produits chimiques comme le Captan, le Chlorothalonil, le Mancozèbe, le Myclobutanil, le Propiconazole ou le Thiophanate Methyl. Suivez le calendrier et les timings de pulvérisation recommandés pour obtenir les meilleurs résultats.",
        "Coupez et retirez les branches, les feuilles et les fruits infectés. Cette pratique aide à réduire la propagation du champignon.",
        "Assurez un espacement adéquat entre les arbres pour une bonne circulation de l'air. Une meilleure circulation de l'air aide à réduire l'humidité et la croissance des champignons.",
        "Collectez et détruisez les feuilles tombées à l'automne ou au début du printemps. Cela réduit la principale source du champignon.",
        "Mélangez 5% d'urée avec de l'eau et pulvérisez-le sur les arbres après la récolte ou sur les feuilles tombées à l'automne ou au printemps. Cela aide les feuilles à se décomposer plus rapidement et réduit le champignon.",
        "Envisagez de planter des variétés de pommes résistantes à la tavelure. Cette approche proactive peut prévenir les problèmes futurs.",
        "Faites attention à la météo, surtout pendant les printemps frais et humides. Prendre des mesures préventives pendant ces périodes peut aider.",
        "Utilisez des méthodes biologiques comme l'huile de neem ou les pulvérisations à base de soufre pour une approche plus naturelle de la gestion de la tavelure."
    ],
    "Pourriture Noire du Pommier": [
        "Pulvérisez des produits chimiques comme le Captan ou le Mancozèbe sur vos pommiers. Faites-le en début de saison de croissance et suivez les instructions sur l'étiquette.",
        "Coupez et retirez les branches, les feuilles et les fruits infectés. Nettoyez toujours vos outils de taille pour éviter de propager la maladie.",
        "Gardez vos arbres bien arrosés et fertilisés pour améliorer leur santé générale et leur résistance aux maladies.",
        "Assurez un espace suffisant entre les arbres pour une bonne circulation de l'air. Cela aide à garder les feuilles sèches et réduit la croissance des champignons.",
        "Ramassez et éliminez régulièrement les feuilles et les fruits tombés. Cela aide à éliminer la source de la maladie.",
        "Soyez attentif aux conditions météorologiques, surtout pendant les périodes chaudes et humides. Prenez des mesures préventives lorsque les conditions favorisent la maladie.",
        "Utilisez des traitements biologiques comme l'huile de neem pour gérer la maladie naturellement."
    ],
    "Rouille du Pommier et du Genévrier": [
        "Enlevez les genévriers à proximité pour réduire le risque.",
        "Appliquez des fongicides comme le Myclobutanil ou le Propiconazole au début de la saison de croissance.",
        "Coupez et retirez les feuilles, les fruits ou les branches montrant des signes de rouille.",
        "Faites attention à la météo, surtout pendant les périodes chaudes et humides.",
        "Choisissez des variétés de pommes résistantes à la rouille du pommier.",
        "Assurez un bon espacement entre les arbres pour permettre la libre circulation de l'air.",
        "Utilisez des traitements biologiques comme les pulvérisations de soufre ou l'huile de neem."
    ],
    "Pommier Sain": [
        "Continuez à surveiller régulièrement et à prendre soin correctement.",
        "Assurez un espacement et une taille appropriés pour une bonne circulation de l'air.",
        "Utilisez des engrais équilibrés pour maintenir la santé des arbres.",
        "Appliquez du paillis autour de la base des arbres pour retenir l'humidité.",
        "Surveillez les signes de maladie ou de parasites et prenez des mesures rapides."
    ],
    "Tache Angulaire des Feuilles de Haricot": [
        "Appliquez des fongicides tels que des sprays à base de cuivre selon les instructions de l'étiquette.",
        "Faites une rotation des cultures pour éviter de planter des haricots au même endroit année après année.",
        "Enlevez et détruisez les débris de plantes infectées pour réduire la source du champignon.",
        "Assurez un espacement adéquat et une circulation d'air autour des plantes pour réduire l'humidité.",
        "Arrosez les plantes à la base pour éviter de mouiller le feuillage, ce qui peut encourager la croissance des champignons."
    ],
    "Haricot Sain": [
        "Maintenez une bonne santé du sol avec une fertilisation régulière et de la matière organique.",
        "Assurez un espacement adéquat et une circulation d'air autour des plantes.",
        "Surveillez régulièrement les signes de maladie ou de parasites et agissez rapidement.",
        "Utilisez l'irrigation goutte-à-goutte pour garder le feuillage sec et réduire le risque de maladies fongiques.",
        "Faites une rotation des cultures pour prévenir l'accumulation de maladies transmises par le sol."
    ],
    "Rouille du Haricot": [
        "Appliquez des fongicides comme le chlorothalonil ou le mancozèbe selon les recommandations de l'étiquette.",
        "Enlevez et détruisez les débris de plantes infectées pour empêcher la propagation du champignon.",
        "Assurez un espacement adéquat et une circulation d'air autour des plantes pour réduire l'humidité.",
        "Évitez l'arrosage par aspersion pour garder le feuillage sec et réduire la croissance des champignons.",
        "Faites une rotation des cultures pour prévenir l'accumulation de spores de rouille dans le sol."
    ],
    "Oïdium du Cerisier (y compris le cerisier acide)": [
        "Appliquez des fongicides comme le soufre, l'huile de neem ou le bicarbonate de potassium selon les instructions de l'étiquette.",
        "Taillez et enlevez les branches infectées pour améliorer la circulation de l'air et réduire la propagation de la maladie.",
        "Assurez un espacement et une taille adéquats pour une bonne circulation de l'air.",
        "Évitez l'arrosage par aspersion pour garder le feuillage sec et réduire la croissance des champignons.",
        "Nettoyez et éliminez les feuilles et les débris tombés pour réduire la source du champignon."
    ],
    "Cerisier Sain (y compris le cerisier acide)": [
        "Surveillez régulièrement et prenez soin correctement des arbres.",
        "Assurez un espacement et une taille adéquats pour une bonne circulation de l'air.",
        "Utilisez des engrais équilibrés pour maintenir la santé des arbres.",
        "Appliquez du paillis autour de la base des arbres pour retenir l'humidité.",
        "Surveillez les signes de maladie ou de parasites et agissez rapidement."
    ],
    "Tache Foliaire de Cercospora du Maïs": [
        "Appliquez des fongicides tels que des strobilurines ou des triazoles conformément aux recommandations de l'étiquette.",
        "Effectuez une rotation des cultures pour empêcher l'accumulation de spores fongiques dans le sol.",
        "Enlevez et détruisez les débris de plantes infectées pour réduire la source du champignon.",
        "Assurez un espacement adéquat et une bonne circulation de l'air autour des plantes pour réduire l'humidité.",
        "Plantez des variétés de maïs résistantes pour réduire le risque d'infection."
    ],
    "Rouille Commune du Maïs": [
        "Appliquez des fongicides tels que le mancozèbe ou le chlorothalonil conformément aux recommandations de l'étiquette.",
        "Effectuez une rotation des cultures pour empêcher l'accumulation de spores de rouille dans le sol.",
        "Enlevez et détruisez les débris de plantes infectées pour réduire la source du champignon.",
        "Assurez un espacement adéquat et une bonne circulation de l'air autour des plantes pour réduire l'humidité.",
        "Plantez des variétés de maïs résistantes pour réduire le risque d'infection."
    ],
    "Brûlure des Feuilles du Nord du Maïs": [
        "Appliquez des fongicides tels que l'azoxystrobine, la pyraclostrobine ou le prothioconazole dès les premiers signes de la maladie. Suivez les instructions de l'étiquette pour l'application.",
        "Effectuez une rotation des cultures avec des cultures non hôtes telles que le soja ou les petites céréales pour réduire la pression de la maladie.",
        "Sélectionnez des variétés hybrides résistantes ou tolérantes au Nord de la brûlure des feuilles.",
        "Labourez les débris de culture après la récolte pour réduire la quantité d'inoculum présent dans le champ.",
        "Les dates de plantation peuvent être ajustées pour éviter les périodes de forte pression de la maladie."
    ],
    "Maïs Sain": [
        "Maintenez une surveillance régulière pour garantir l'absence de maladies.",
        "Continuez une fertilisation équilibrée et des pratiques d'irrigation adéquates.",
        "Surveillez les conditions environnementales qui peuvent favoriser les épidémies de maladies.",
        "Assurez une bonne hygiène du champ et effectuez une rotation des cultures pour éviter l'accumulation des maladies.",
        "Utilisez des variétés hybrides connues pour leur résistance aux maladies."
    ],
    "Pourriture Noire de la Vigne": [
        "Appliquez des fongicides tels que le Myclobutanil, le Mancozèbe ou le Captan dès le stade pré-floraison. Suivez un calendrier de pulvérisation régulier selon les recommandations.",
        "Taillez et enlevez les cannes et les fruits momifiés infectés pendant la période de dormance pour réduire l'inoculum.",
        "Assurez une bonne circulation de l'air dans le vignoble en effectuant une taille adéquate et en espaçant bien les vignes.",
        "Enlevez et détruisez les feuilles et les fruits tombés pour éliminer les sources d'infection.",
        "Utilisez des variétés de raisin résistantes si disponibles."
    ],
    "Esca de la Vigne (Rougeole Noire)": [
        "Enlevez et brûlez le bois infecté pour prévenir la propagation.",
        "Appliquez des fongicides à titre préventif, surtout après de fortes pluies.",
        "Améliorez le drainage du sol pour réduire l'engorgement, ce qui peut aggraver la maladie.",
        "Pratiquez une bonne hygiène du vignoble en enlevant et en détruisant les tailles.",
        "Évitez de blesser les vignes lors des opérations culturales pour réduire les sites d'infection."
    ],
    "Brûlure des Feuilles de la Vigne (Tache Foliaire d'Isariopsis)": [
        "Appliquez des fongicides protecteurs tels que le Mancozèbe ou des produits à base de cuivre dès les premiers signes de la maladie.",
        "Taillez les feuilles et les cannes affectées pour réduire l'inoculum de la maladie.",
        "Assurez une bonne gestion du vignoble pour réduire l'humidité et favoriser la circulation de l'air.",
        "Enlevez et détruisez les feuilles et les débris tombés dans le vignoble.",
        "Envisagez d'utiliser des variétés ou des porte-greffes résistants si disponibles."
    ],
    "Vigne Saine": [
        "Surveillez régulièrement le vignoble pour détecter les signes de maladie.",
        "Maintenez un programme de fertilisation équilibré pour garder les vignes en bonne santé.",
        "Assurez des pratiques d'irrigation adéquates pour éviter le stress hydrique.",
        "Pratiquez une bonne gestion du feuillage pour améliorer la circulation de l'air.",
        "Gardez le sol du vignoble propre en enlevant les mauvaises herbes et les débris."
    ],
    "Tache Bactérienne du Poivron": [
        "Appliquez des bactéricides à base de cuivre dès les premiers signes de la maladie. Suivez les recommandations de l'étiquette pour la fréquence d'application.",
        "Enlevez et détruisez le matériel végétal infecté pour réduire la propagation de la maladie.",
        "Utilisez l'irrigation goutte-à-goutte au lieu de l'arrosage par aspersion pour garder le feuillage sec.",
        "Pratiquez la rotation des cultures avec des cultures non hôtes pour minimiser l'accumulation de la maladie dans le sol.",
        "Utilisez des variétés de poivrons résistantes si disponibles."
    ],
    "Poivron Sain": [
        "Surveillez régulièrement vos poivrons pour détecter les signes de maladie.",
        "Maintenez un programme de fertilisation équilibré pour assurer la santé des plantes.",
        "Utilisez l'irrigation goutte-à-goutte pour garder le feuillage sec et réduire les risques de maladies.",
        "Gardez la zone de culture exempte de mauvaises herbes et de débris pour améliorer la circulation de l'air.",
        "Pratiquez la rotation des cultures pour prévenir l'accumulation de maladies transmises par le sol."
    ],
    "Tavelure Précoce de la Pomme de Terre": [
        "Appliquez des fongicides tels que le Chlorothalonil ou le Mancozèbe dès les premiers signes de la maladie. Suivez les instructions de l'étiquette pour l'application.",
        "Enlevez et détruisez les débris de plantes infectées pour réduire les sources d'inoculum.",
        "Évitez l'arrosage par aspersion pour garder le feuillage sec et réduire la propagation de la maladie.",
        "Plantez des pommes de terre dans un sol bien drainé et évitez les arrosages excessifs.",
        "Pratiquez la rotation des cultures avec des cultures non hôtes pour minimiser l'accumulation de la maladie dans le sol."
    ],
    "Mildiou Tardif de la Pomme de Terre": [
        "Appliquez des fongicides tels que le Chlorothalonil, le Mancozèbe ou des produits à base de cuivre dès les premiers signes de la maladie. Respectez les intervalles de pulvérisation recommandés.",
        "Enlevez et détruisez le matériel végétal infecté pour empêcher la propagation.",
        "Assurez une bonne circulation de l'air en espaçant correctement les plantes et en élaguant si nécessaire.",
        "Évitez l'irrigation par aspersion et arrosez les plantes à la base pour réduire l'humidité des feuilles.",
        "Plantez des variétés de pommes de terre résistantes au mildiou si disponibles."
    ],
    "Pomme de Terre Saine": [
        "Inspectez régulièrement les plants de pommes de terre pour détecter tout signe de maladie ou de dommage causé par des ravageurs.",
        "Maintenez un calendrier d'arrosage constant pour éviter le stress hydrique.",
        "Fertilisez avec des nutriments équilibrés pour soutenir une croissance saine.",
        "Gardez le jardin exempt de mauvaises herbes et de débris pour promouvoir une bonne circulation de l'air.",
        "Pratiquez la rotation des cultures pour maintenir la santé du sol et prévenir l'accumulation de maladies."
    ],
    "Brûlure des Feuilles du Fraisier": [
        "Appliquez des fongicides tels que le Captan ou le Myclobutanil dès les premiers signes de la maladie. Suivez les instructions de l'étiquette pour l'application.",
        "Enlevez et détruisez les feuilles et les débris infectés pour réduire la propagation de la maladie.",
        "Assurez une bonne circulation de l'air en espaçant adéquatement les plantes et en les élaguant si nécessaire.",
        "Arrosez les plantes à la base plutôt que par aspersion pour garder le feuillage sec.",
        "Utilisez des variétés de fraises résistantes si disponibles."
    ],
    "Fraisier Sain": [
        "Surveillez régulièrement les plants de fraises pour détecter les signes de maladie ou de ravageurs.",
        "Maintenez un calendrier de fertilisation équilibré pour favoriser une croissance saine.",
        "Arrosez les plantes à la base pour éviter de mouiller le feuillage et réduire le risque de maladie.",
        "Gardez la zone de plantation exempte de mauvaises herbes et de débris pour améliorer la circulation de l'air.",
        "Pratiquez la rotation des cultures pour prévenir les maladies transmises par le sol."
    ],
    "Tache Bactérienne de la Tomate": [
        "Appliquez des bactéricides à base de cuivre dès les premiers signes de la maladie. Suivez les instructions de l'étiquette pour l'application.",
        "Enlevez et détruisez le matériel végétal infecté pour réduire la propagation de la maladie.",
        "Utilisez l'irrigation goutte-à-goutte pour éviter de mouiller le feuillage et réduire le risque d'infection.",
        "Pratiquez la rotation des cultures avec des plantes non hôtes pour minimiser l'accumulation de la maladie dans le sol.",
        "Utilisez des variétés de tomates résistantes si disponibles."
    ],
    "Brûlure Précoce de la Tomate": [
        "Appliquez des fongicides tels que le Chlorothalonil ou le Mancozèbe dès les premiers signes de la maladie. Suivez les recommandations de l'étiquette pour l'utilisation.",
        "Enlevez et détruisez les feuilles et les débris de plantes affectés pour minimiser les sources d'infection.",
        "Évitez l'arrosage par aspersion pour garder les feuilles sèches et réduire la propagation de la maladie.",
        "Espacez les plantes de manière adéquate pour assurer une bonne circulation de l'air.",
        "Pratiquez la rotation des cultures et utilisez des variétés de tomates résistantes aux maladies."
    ],
    "Mildiou Tardif de la Tomate": [
        "Appliquez des fongicides tels que le Chlorothalonil, le Mancozèbe ou des produits à base de cuivre dès les premiers signes de la maladie. Suivez les instructions de l'étiquette pour l'application.",
        "Enlevez et détruisez les plants infectés pour empêcher la propagation.",
        "Assurez une bonne circulation de l'air en espaçant correctement les plantes et en les élaguant si nécessaire.",
        "Évitez l'arrosage par aspersion et arrosez les plantes à la base pour réduire l'humidité des feuilles.",
        "Plantez des variétés de tomates résistantes au mildiou si disponibles."
    ],
    "Moisissure des Feuilles de la Tomate": [
        "Appliquez des fongicides tels que le Chlorothalonil ou des produits à base de cuivre dès l'apparition des symptômes. Suivez les instructions de l'étiquette pour l'application.",
        "Taillez les feuilles affectées et assurez une bonne circulation de l'air autour des plantes.",
        "Réduisez les niveaux d'humidité dans la zone de culture pour prévenir la maladie.",
        "Arrosez les plantes à la base pour garder le feuillage sec.",
        "Utilisez des variétés résistantes aux maladies lorsque cela est possible."
    ],
    "Tache Septorienne des Feuilles de la Tomate": [
        "Appliquez des fongicides tels que le Chlorothalonil ou des produits à base de cuivre dès les premiers signes de la maladie. Suivez les instructions de l'étiquette pour l'application.",
        "Enlevez et détruisez les feuilles et les débris infectés pour réduire les sources d'infection.",
        "Espacer les plantes pour assurer une bonne circulation de l'air et réduire l'humidité.",
        "Évitez l'arrosage par aspersion et arrosez les plantes à la base pour garder le feuillage sec.",
        "Pratiquez la rotation des cultures et utilisez des variétés de tomates résistantes."
    ],
    "Tétranyques Araignées de la Tomate": [
        "Appliquez des acaricides ou du savon insecticide pour contrôler les tétranyques. Suivez les instructions de l'étiquette pour l'application.",
        "Gardez les plantes bien arrosées pour réduire le stress et les rendre moins susceptibles aux infestations de tétranyques.",
        "Enlevez et détruisez les feuilles fortement infestées pour réduire les populations de tétranyques.",
        "Encouragez les prédateurs naturels tels que les coccinelles et les acariens prédateurs.",
        "Surveillez régulièrement les plantes pour détecter les signes de tétranyques et intervenez rapidement."
    ],
    "Tache Cible de la Tomate": [
        "Appliquez des fongicides tels que le Mancozèbe ou des produits à base de cuivre dès les premiers signes de la maladie. Suivez les recommandations de l'étiquette pour l'utilisation.",
        "Enlevez et détruisez les feuilles et les débris de plantes affectés pour minimiser les sources d'infection.",
        "Assurez une bonne circulation de l'air autour des plantes en espaçant correctement et en élaguant.",
        "Arrosez les plantes à la base pour garder le feuillage sec et réduire la propagation de la maladie.",
        "Utilisez des variétés de tomates résistantes aux maladies lorsque disponibles."
    ],
    "Virus de l'Enroulement Jaune des Feuilles de la Tomate": [
        "Contrôlez les populations d'aleurodes avec des insecticides pour réduire la propagation du virus. Suivez les instructions de l'étiquette pour l'utilisation.",
        "Enlevez et détruisez les plantes infectées pour empêcher la propagation.",
        "Utilisez des variétés de tomates résistantes aux virus si disponibles.",
        "Mettez en œuvre des pratiques d'assainissement appropriées en nettoyant les outils et les équipements.",
        "Utilisez des paillis réfléchissants pour repousser les aleurodes et réduire l'incidence du virus."
    ],
    "Virus de la Mosaïque de la Tomate": [
        "Enlevez et détruisez les plantes infectées pour empêcher la propagation du virus.",
        "Pratiquez une bonne hygiène en nettoyant les mains, les outils et l'équipement après avoir manipulé les plantes infectées.",
        "Utilisez des semences et des plants exempts de virus pour réduire le risque d'infection.",
        "Évitez de fumer près des plants de tomates, car le virus peut se propager par les produits du tabac.",
        "Utilisez des variétés de tomates résistantes si disponibles."
    ],
    "Tomate Saine": [
        "Surveillez régulièrement les plants de tomates pour détecter tout signe de maladie ou de problème de parasites.",
        "Maintenez un programme de fertilisation équilibré pour soutenir une croissance saine.",
        "Arrosez les plantes à la base pour éviter de mouiller le feuillage et réduire le risque de maladie.",
        "Assurez une bonne circulation de l'air en espaçant correctement les plantes."
    ]
}